applications/test/dissolutionDBS/calciteCrystalWithHeat/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "epsSolid.*"
    {
        solver          diagonal;
    }


    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|e|Y)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|e|Y)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}

// PIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     nCorrectors         2;
// }

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    nOuterCorrectors  10;

    outerCorrectorResidualControl
    {
        e     
        {
            tolerance  1e-6;
            relTol     0;
        }

        Y    
        {
            tolerance  1e-6;
            relTol     0;
        }

        p_rgh      
        {
            tolerance  1e-6;
            relTol     0;
        }
        
    }

    p_rghRefCell          (2e-4 0 0);
    p_rghRefValue         0;
}

relaxationFactors
{
    equations
    {
        "Y"            0.7;
        "e"            0.7;
    }
    equations
    {
        "YFinal"            1.0;
        "eFinal"            1.0;
    }
}

// ************************************************************************* //
